Repository: Light2d/ebayAuc
Catalog: locale/*/LC_MESSAGES/django.po
Languages: el, lb

source: The social account is already connected to a different account.
el: Ο κοινωνικός λογαριασμός είναι ήδη συνδεδεμένος με διαφορετικό λογαριασμό.
lb: D'Sozial Kont ass schonn mat engem anere Kont verbonnen.

source: The social account has been disconnected.
el: Ο κοινωνικός λογαριασμός αποσυνδέθηκε επιτυχώς.
lb: D'Sozial Kont gouf ofverbonnen.

source: First name
el: Όνομα
lb: Virnumm

source: Last name
el: Επώνυμο
lb: Numm

source: Street address
el: Διεύθυνση οδού
lb: Strooss Adress

source: Street address 2 (optional)
el: Διεύθυνση οδού 2 (προαιρετικό)
lb: Strooss Adress 2 (fakultativ)

source: City
el: Πόλη
lb: Stad

source: Country or region
el: Χώρα ή περιοχή
lb: Land oder Regioun

source: State/Province/Re...
el: Πολιτεία/Επαρχία/Περιοχή...
lb: Staat/Provinz/Re...

source: ZIP Code
el: Ταχυδρομικός Κώδικας

source: Email
el: ηλεκτρονικού

source: Confirm email
el: επιβεβαίωση ηλεκτρονικού ταχυδρομείου
lb: E-Mail bestätegen

source: Country Code
el: Κωδικός Χώρας
lb: Landescode

source: Phone number (required)
el: Τηλεφωνικός αριθμός (απαιτείται)
lb: Telefonnummer (néideg)

source: Region
el: Περιοχή
lb: Regioun

source: Address
el: Διεύθυνση
lb: Adress

source: Additional information (optional)
el: Πρόσθετες πληροφορίες (προαιρετικά)
lb: Zousätzlech Informatiounen (fakultativ)

source: Phone number
el: Τηλεφώνου
lb: Telefonnummer

source: Dutch
lb: Hollännesch

source: Slovak
lb: Slovakesch

source: Luxembourgish
lb: Lëtzebuergesch

source: You're receiving this e-mail because you or someone else has requested a password for your user account. It can be safely ignored if you did not request a password reset. Click the link below to reset your password.
lb: Dir kritt dëse Mail well dir oder een anere gefrot huet, en Passwuert fir Är Benotzerkont ze kreien. Et kann sécher ignoriert ginn, wann dir keng Passwuertzrécksetzung gefrot hutt. Klickt op de Link ënnen drënner fir Äert Passwuert zréckzefänken.

source: Last bid by -
lb: Leschte Gebot vun -

source: You are about to use your %(provider_name)s account to login to %(site_name)s. As a final step, please complete the following form:
lb: Ihr sidd drun Ären %(provider_name)s Kont ze benotzen fir Iech op %(site_name)s ageloggt. Als leschten Schrëtt, komplettéiert w.e.g. d'folgend Formular:
