Repository: Light2d/ebayAuc
Catalog: locale/*/LC_MESSAGES/django.po
Languages: el, lb

source: German
el: Γερμανικά
lb: Däitsch

source: English
el: Αγγλικά
lb: Englesch

source: French
el: Γαλλικά
lb: Franséisch

source: Spanish
el: Ισπανικά

source: Portuguese
el: Πορτογαλικά
lb: Portugisesch

source: Greek
el: Ελληνικά
lb: Griichesch

source: Account Inactive
el: Ανενεργός Λογαριασμός
lb: Kont Inaktiv

source: This account is inactive.
el: Αυτός ο λογαριασμός είναι ανενεργός.
lb: Dëst Kont ass inaktiv.

source: E-mail Addresses
el: Διευθύνσεις Ηλεκτρονικού Ταχυδρομείου
lb: E-Mail Adressen

source: The following e-mail addresses are associated with your account:
el: Οι παρακάτω διευθύνσεις ηλεκτρονικού ταχυδρομείου σχετίζονται με τον λογαριασμό σας:
lb: D'folgend E-Mail-Adressen sinn mat ärer Rechnung verbonnen:

source: Verified
el: Επαληθευμένο
lb: Verifizéiert

source: Unverified
el: Μη επαληθευμένο
lb: Onverifizéiert

source: Primary
el: Κύριο
lb: Haapt

source: Make Primary
el: Κάντε Κύριο
lb: Haapt maachen

source: Re-send Verification
el: Επαναποστολή Επαλήθευσης
lb: Verifikatioun erëm schécken

source: Remove
el: Αφαίρεση
lb: Ewech huelen

source: Warning:
el: Προειδοποίηση:
lb: Warnung:

source: You currently do not have any e-mail address set up. You should really add an e-mail address so you can receive notifications, reset your password, etc.
el: Αυτή τη στιγμή δεν έχετε καμία διεύθυνση email εγκατεστημένη. Πρέπει πραγματικά να προσθέσετε μια διεύθυνση email ώστε να μπορείτε να λαμβάνετε ειδοποιήσεις, να επαναφέρετε τον κωδικό πρόσβασής σας, κλπ.
lb: Dir hutt aktuell keng E-Mail-Adress agestallt. Dir sollt wirklech eng E-Mail-Adress derbäisetzen, fir Benotzermeldungen ze kreien, Äert Passwuert ze erënnern, etc.

source: Add E-mail Address
el: Προσθήκη Διεύθυνσης Ηλεκτρονικού Ταχυδρομείου
lb: E-Mail-Adress derbäisetzen

source: Add E-mail
el: Προσθήκη Email
lb: E-Mail derbäisetzen

source: Do you really want to remove the selected e-mail address?
el: Θέλετε πραγματικά να αφαιρέσετε την επιλεγμένη διεύθυνση email;
lb: Wëllt dir wirklech déi ausgewielte E-Mail-Adress ewech huelen?

source: Hello from %(site_name)s!
el: Γεια σας από το %(site_name)s!
lb: Hallo vun %(site_name)s!

source: Thank you for using %(site_name)s! %(site_domain)s
el: Σας ευχαριστούμε που χρησιμοποιήσατε το %(site_name)s! %(site_domain)s
lb: Merci fir d'Benotzen vun %(site_name)s! %(site_domain)s

source: You're receiving this e-mail because user %(user_display)s has given your e-mail address to register an account on %(site_domain)s. To confirm this is correct, go to %(activate_url)s
el: Λαμβάνετε αυτό το email επειδή ο χρήστης %(user_display)s έχει δώσει την διεύθυνση email σας για να εγγραφεί σε λογαριασμό στο %(site_domain)s. Για να επιβεβαιώσετε ότι είναι σωστό, μεταβείτε στο %(activate_url)s
lb: Dir krutt dëse Mail, well de Benotzer %(user_display)s däi E-Mail-Adress ginn huet, fir sech op %(site_domain)s ze registréieren. Zur Bestätegung, datt dat richteg ass, gitt op %(activate_url)s

source: Please Confirm Your E-mail Address
el: Παρακαλώ Επιβεβαιώστε τη Διεύθυνση Ηλεκτρονικού Ταχυδρομείου σας
lb: Bestätegt w.e.g. Är E-Mail-Adress

source: In case you forgot, your username is %(username)s.
el: Σε περίπτωση που το ξεχάσατε, το όνομά σας χρήστη είναι %(username)s.
lb: Falls Dir et vergiess hutt, Ären Benotzernumm ass %(username)s.

source: Password Reset E-mail
el: Επαναφορά Κωδικού Ηλεκτρονικού Ταχυδρομείου
lb: Passwuertzrécksetzung E-Mail

source: You are receiving this e-mail because you or someone else has requested a password for your user account. However, we do not have any record of a user with email %(email)s in our database. This mail can be safely ignored if you did not request a password reset. If it was you, you can sign up for an account using the link below.
el: Λαμβάνετε αυτό το ηλεκτρονικό μήνυμα επειδή εσείς ή κάποιος άλλος ζήτησε έναν κωδικό πρόσβασης για τον λογαριασμό χρήστη σας. Ωστόσο, δεν έχουμε καμία εγγραφή χρήστη με το ηλεκτρονικό ταχυδρομείο %(email)s στη βάση δεδομένων μας. Αυτό το μήνυμα μπορεί να αγνοηθεί αν δεν ζητήσατε επαναφορά κωδικού. Αν ήταν εσείς, μπορείτε να εγγραφείτε για ένα λογαριασμό χρησιμοποιώντας τον σύνδεσμο παρακάτω.
lb: Dir krutt dëse Mail well dir oder een anere gefrot huet, en Passwuert fir Är Benotzerkont ze kreien. Allerdéngs hunn mir kee Record vu engem Benotzer mat der E-Mail-Adress %(email)s an eiser Datebank. Dëse Mail kann sécher ignoriert ginn, wann Dir keng Passwuertzrécksetzung gefrot hutt. Wann et Dir wort, kënnt Dir iech mat engem Benotzerkont iwwer de Link ënnen drënner agestallt.

source: Confirm E-mail Address
el: Επιβεβαιώστε τη Διεύθυνση Ηλεκτρονικού Ταχυδρομείου
lb: Bestätegt w.e.g. Är E-Mail-Adress

source: Please confirm that <a href="mailto:%(email)s">%(email)s</a> is an e-mail address for user %(user_display)s.
el: Παρακαλούμε επιβεβαιώστε ότι το <a href="mailto:%(email)s">%(email)s</a> είναι μια διεύθυνση ηλεκτρονικού ταχυδρομείου για τον χρήστη %(user_display)s.
lb: Bestätegt w.e.g. datt <a href="mailto:%(email)s">%(email)s</a> eng E-Mail-Adress fir de Benotzer %(user_display)s ass.

source: Confirm
el: Επιβεβαίωση
lb: Bestätegen

source: This e-mail confirmation link expired or is invalid. Please <a href="%(email_url)s">issue a new e-mail confirmation request</a>.
el: Ο σύνδεσμος επιβεβαίωσης ηλεκτρονικού ταχυδρομείου έχει λήξει ή είναι άκυρος. Παρακαλώ <a href="%(email_url)s">εκδόστε ένα νέο αίτημα επιβεβαίωσης ηλεκτρονικού ταχυδρομείου</a>.
lb: Dëse Link fir d'E-Mail-Bestätegung ass ofgelaf oder ungëlteg. W.e.g. <a href="%(email_url)s">e neit Ufro fir d'E-Mail-Bestätegung ze kreien</a>.

source: Sign In
el: Είσοδος
lb: Umellen

source: Please sign in with one of your existing third party accounts. Or, <a href="%(signup_url)s">sign up</a> for a %(site_name)s account and sign in below:
el: Παρακαλούμε συνδεθείτε με ένα από τους υπάρχοντες λογαριασμούς τρίτων. Ή, <a href="%(signup_url)s">εγγραφείτε</a> για ένα λογαριασμό %(site_name)s και συνδεθείτε παρακάτω:
lb: Meldech w.e.g. mat enger vun äre bestehende Konten un. Oder, <a href="%(signup_url)s">mell dech un</a> fir e(n) %(site_name)s-Konto unzemaachen an deem dir iech hei unt meldt:

source: or
el: ή
lb: oder

source: If you have not created an account yet, then please <a href="%(signup_url)s">sign up</a> first.
el: Αν δεν έχετε δημιουργήσει ακόμα λογαριασμό, τότε παρακαλώ <a href="%(signup_url)s">εγγραφείτε</a> πρώτα.
lb: Wann Dir nach keng Rechnung agestallt hutt, da <a href="%(signup_url)s">mellt iech un</a> éischten.

source: Forgot Password?
el: Ξεχάσατε τον Κωδικό;
lb: Passwuert vergiess?

source: Sign Out
el: Αποσύνδεση
lb: Ausloggen

source: Are you sure you want to sign out?
el: Είστε σίγουρος ότι θέλετε να αποσυνδεθείτε;
lb: Sidd Dir sécher datt Dir auslogge wëllt?

source: You cannot remove your primary e-mail address (%(email)s).
el: Δεν μπορείτε να αφαιρέσετε την κύρια διεύθυνση ηλεκτρονικού ταχυδρομείου σας (%(email)s).
lb: Dir kënnt Är Haapt-E-Mail-Adress (%(email)s) net ewech huelen.

source: Confirmation e-mail sent to %(email)s.
el: Το ηλεκτρονικό μήνυμα επιβεβαίωσης εστάλη στο %(email)s.
lb: Bestätegungsmail un %(email)s geschéckt.

source: You have confirmed %(email)s.
el: Επιβεβαιώσατε το %(email)s.
lb: Dir hutt %(email)s bestätegt.

source: Removed e-mail address %(email)s.
el: Αφαιρέθηκε η διεύθυνση ηλεκτρονικού ταχυδρομείου %(email)s.
lb: E-Mail-Adress %(email)s ewech geholl.

source: Successfully signed in as %(name)s.
el: Επιτυχής σύνδεση ως %(name)s.
lb: Erfollegräich umellt als %(name)s.

source: You have signed out.
el: Αποσυνδεθήκατε.
lb: Dir hutt iech ausgeloggt.

source: Password successfully changed.
el: Ο κωδικός άλλαξε επιτυχώς.
lb: Passwuert erfollegräich geännert.

source: Password successfully set.
el: Ο κωδικός ορίστηκε με επιτυχία.
lb: Passwuert erfollegräich agestallt.

source: Primary e-mail address set.
el: Ορίστηκε η κύρια διεύθυνση ηλεκτρονικού ταχυδρομείου.
lb: Haapt-E-Mail-Adress agestallt.

source: Your primary e-mail address must be verified.
el: Η κύρια σας διεύθυνση ηλεκτρονικού ταχυδρομείου πρέπει να επιβεβαιωθεί.
lb: Är Haapt-E-Mail-Adress muss verifizéiert ginn.

source: Change Password
el: Αλλαγή Κωδικού
lb: Passwuert änneren

source: Password Reset
el: Επαναφορά Κωδικού
lb: Passwuertzrécksetzung

source: Forgotten your password? Enter your e-mail address below, and we'll send you an e-mail allowing you to reset it.
el: Ξεχάσατε τον κωδικό σας; Εισάγετε τη διεύθυνση ηλεκτρονικού ταχυδρομείου σας παρακάτω, και θα σας στείλουμε ένα ηλεκτρονικό μήνυμα που θα σας επιτρέψει να τον επαναφέρετε.
lb: Hutt Dir Äert Passwuert vergiess? Gitt Är E-Mail-Adress hei ënnen an mir schécken Iech eng E-Mail, déi et Iech erlabt Äert Passwuert zréckzefänken.

source: Reset My Password
el: Επαναφορά του Κωδικού Μου
lb: Setzt mäi Passwuert zréck

source: Please contact us if you have any trouble resetting your password.
el: Παρακαλούμε επικοινωνήστε μαζί μας αν αντιμετωπίζετε προβλήματα κατά την επαναφορά του κωδικού σας.
lb: W.e.g. kontaktéiert eis, wann Dir e Probleem beim Zrécksetzen vum Passwuert hutt.

source: We have sent you an e-mail. If you have not received it please check your spam folder. Otherwise contact us if you do not receive it in a few minutes.
el: Σας έχουμε στείλει ένα ηλεκτρονικό μήνυμα. Εάν δεν το λάβετε, παρακαλούμε ελέγξτε το φάκελο ανεπιθύμητης αλληλογραφίας σας. Διαφορετικά επικοινωνήστε μαζί μας εάν δεν το λάβετε μέσα σε λίγα λεπτά.
lb: Mir hunn Iech eng E-Mail geschéckt. Falls dir se net kritt hutt, kuckt w.e.g. an är Spam-Ordner. Aneres kontaktéiert eis wann Dir se net an eng puer Minutten kritt.

source: Bad Token
el: Άκυρο Διακριτικό
lb: Schlecht Token

source: The password reset link was invalid, possibly because it has already been used. Please request a <a href="%(passwd_reset_url)s">new password reset</a>.
el: Ο σύνδεσμος επαναφοράς κωδικού ήταν άκυρος, πιθανώς επειδή έχει ήδη χρησιμοποιηθεί. Παρακαλώ ζητήστε ένα <a href="%(passwd_reset_url)s">νέο αίτημα επαναφοράς κωδικού</a>.
lb: Dëse Link fir d'Passwuert zréckzefänken ass ungëlteg, wahrscheinlech well en schonn benotzt gouf. W.e.g. fuerter <a href="%(passwd_reset_url)s">e neien Link fir d'Passwuert zréckzefänken</a> ufroen.

source: change password
el: αλλαγή κωδικού
lb: Passwuert änneren

source: Your password is now changed.
el: Ο κωδικός σας άλλαξε τώρα.
lb: Äert Passwuert ass elo geännert.

source: Set Password
el: Ορισμός Κωδικού
lb: Setzt Passwuert

source: Signup
el: Εγγραφή
lb: Aloggen

source: Sign Up
el: Εγγραφή
lb: Umellen

source: Already have an account? Then please <a href="%(login_url)s">sign in</a>.
el: Έχετε ήδη λογαριασμό; Τότε παρακαλώ <a href="%(login_url)s">συνδεθείτε</a>.
lb: Hutt scho e Konto? Da <a href="%(login_url)s">mellt Iech un</a>.

source: Sign Up Closed
el: Εγγραφή Κλειστή
lb: Aloggen zu

source: We are sorry, but the sign up is currently closed.
el: Λυπούμαστε, αλλά η εγγραφή είναι προσωρινά κλειστή.
lb: Mir entschëllegen eis, mä den Aloggen ass aktuell zou.

source: Note
el: Σημείωση
lb: Bemierkung

source: you are already logged in as %(user_display)s.
el: είστε ήδη συνδεδεμένος ως %(user_display)s.
lb: Dir sidd schonn als %(user_display)s ageloggt.

source: Verify Your E-mail Address
el: Επιβεβαιώστε τη Διεύθυνση Ηλεκτρονικού Ταχυδρομείου σας
lb: Verifizéiert Är E-Mail-Adress

source: We have sent an e-mail to you for verification. Follow the link provided to finalize the signup process. If you do not see the verification e-mail in your main inbox, check your spam folder. Please contact us if you do not receive the verification e-mail within a few minutes.
el: Σας έχουμε στείλει ένα ηλεκτρονικό μήνυμα για επιβεβαίωση. Ακολουθήστε τον σύνδεσμο που παρέχεται για να ολοκληρώσετε τη διαδικασία εγγραφής. Εάν δεν βλέπετε το ηλεκτρονικό μήνυμα επιβεβαίωσης στον κύριο φάκελο εισερχομένων σας, ελέγξτε το φάκελο ανεπιθύμητης αλληλογραφίας σας. Παρακαλούμε επικοινωνήστε μαζί μας εάν δεν λάβετε το ηλεκτρονικό μήνυμα επιβεβαίωσης μέσα σε λίγα λεπτά.
lb: Mir hunn Iech eng E-Mail fir d'Verifizéierung geschéckt. Follegt dem Link fir de Prozess vun der Umeldung ofzeschléissen. Falls Dir d'Verifizéierungsmail net am Haaptpostfach fannt, kuckt an är Spam-Mappen. W.e.g. kontaktéiert eis, wann Dir d'Verifizéierungsmail net a wéinege Minutten krutt.

source: This part of the site requires us to verify that you are who you claim to be. For this purpose, we require that you verify ownership of your e-mail address.
el: Αυτό το τμήμα του ιστότοπου απαιτεί να επιβεβαιώσουμε ότι είστε αυτό που ισχυρίζεστε ότι είστε. Για το σκοπό αυτό, απαιτούμε να επιβεβαιώσετε την κυριότητα της διεύθυνσης ηλεκτρονικού ταχυδρομείου σας.
lb: Dës Deel vum Site verlaangt vu eis Är Identitéit ze verifizéieren, fir sécherzestellen datt Dir wierklech déi Persoun sidd déi Dir vorgebt ze sinn. Fir dat ze maachen, muss Ihr Äert E-Mail-Eegentum verifizéieren.

source: We have sent an e-mail to you for verification. Please click on the link inside that e-mail. If you do not see the verification e-mail in your main inbox, check your spam folder. Otherwise contact us if you do not receive it within a few minutes.
el: Σας έχουμε στείλει ένα ηλεκτρονικό μήνυμα για επιβεβαίωση. Κάντε κλικ στον σύνδεσμο μέσα σε αυτό το ηλεκτρονικό μήνυμα. Εάν δεν βλέπετε το ηλεκτρονικό μήνυμα επιβεβαίωσης στον κύριο φάκελο εισερχομένων σας, ελέγξτε το φάκελο ανεπιθύμητης αλληλογραφίας σας. Διαφορετικά επικοινωνήστε μαζί μας εάν δεν το λάβετε μέσα σε λίγα λεπτά.
lb: Mir hunn Iech eng E-Mail fir d'Verifizéierung geschéckt. Klickt w.e.g. op de Link a dëser E-Mail. Falls Dir d'Verifizéierungsmail net am Haaptpostfach fannt, kuckt an är Spam-Mappen. Anerwäerts kontaktéiert eis, wann Dir se net an e puer Minutten krutt.

source: <strong>Note:</strong> you can still <a href="%(email_url)s">change your e-mail address</a>.
el: <strong>Σημείωση:</strong> μπορείτε ακόμα <a href="%(email_url)s">να αλλάξετε τη διεύθυνση ηλεκτρονικού ταχυδρομείου</a> σας.
lb: <strong>Opgepasst:</strong> Dir kënnt nach ëmmer <a href="%(email_url)s">Är E-Mail-Adress</a> änneren.

source: Find your ZIP code
el: Βρείτε τον ταχυδρομικό σας κώδικα
lb: Fannen Ären ZIP-Code

source: Go to checkout
el: Πηγαίνετε στο ταμείο
lb: Gitt zum Checkout

source: About eBay
el: Σχετικά με το eBay
lb: Iwwer eBay

source: Announcements
el: Ανακοινώσεις
lb: Annoncen

source: Community
el: Κοινότητα
lb: Gemeng

source: Security information
el: Πληροφορίες ασφαλείας
lb: Sécherheetsinformatiounen

source: Seller information center
el: Κέντρο πληροφοριών πωλητή
lb: Verkafs-Informationszentrum

source: Policies
el: Πολιτικές
lb: Richtlinnen

source: Affiliates
el: Συνεργάτες
lb: Affiliéierte

source: Help & Contact
el: Βοήθεια & Επικοινωνία
lb: Hëllef & Kontakt

source: Site Map
el: Χάρτης ιστότοπου

source: Copyright © 1995-2024 eBay Inc. All Rights Reserved.
el: Πνευματικά δικαιώματα © 1995-2024 eBay Inc. Με επιφύλαξη παντός δικαιώματος.
lb: Copyright © 1995-2024 eBay Inc. All Rechter virbehalen.

source: User Agreement,
el: Συμφωνία χρήστη,
lb: Benotzer-Agree,

source: Privacy,
el: Απορρήτου,
lb: Privatsphär,

source: Payments Terms of Use,
el: Όροι χρήσης πληρωμών,
lb: Bezuelungsnutzungskonditioune,

source: Cookies and AdChoice
el: Cookies και AdChoice
lb: Cookies a Wahl vun Annoncen

source: Daiy Deals
el: Καθημερινές προσφορές
lb: Dagesaktiounen

source: SignOut
el: Αποσύνδεση
lb: Ofmellen

source: SignIn
el: Σύνδεση
lb: Ageloggte

source: Ship to
el: Αποστολή προς
lb: Versank

source: Sell
el: Πώληση
lb: Verkafen

source: Watchlist
el: Λίστα επιτήρησης

source: My eBay
el: Ο λογαριασμός μου στο eBay
lb: Mäin eBay

source: eBay Auctions
el: Δημοπρασίες eBay
lb: eBay Auktiounen

source: Fast, safe, profitable trade
el: Γρήγορο, ασφαλές, κερδοφόρο εμπόριο
lb: Schnell, sécher, profitabel Handel

source: Promocode
el: Κωδικός προσφοράς

source: Ok
el: Εντάξει

source: You have successfully applied the promo code for 2€!
el: Επιτυχής εφαρμογή του προωθητικού κωδικού για 2€!
lb: Dir hutt de Promocode erfollegraich fir 2€ applizéiert!

source: This promo code does not exist or has already expired
el: Αυτός ο κωδικός προσφοράς δεν υπάρχει ή έχει ήδη λήξει
lb: Dëse Promocode existéiert net oder ass schonn ofgelaf

source: Active auctions
el: Ενεργές δημοπρασίες
lb: Aktiv Auktiounen

source: Completed auctions
el: Ολοκληρωμένες δημοπρασίες
lb: Ofgeschlossene Auktiounen

source: Remaining time:
el: Υπολειπόμενος χρόνος:
lb: Restzäit:

source: Last bid by
el: Τελευταία προσφορά από
lb: Leschte Gebot vun

source: Highest bid:
el: Υψηλότερη προσφορά:
lb: Héchst Gebot:

source: Increment
el: Αύξηση
lb: Erhéijung

source: Bid
el: Προσφορά
lb: Gebot

source: Sale has ended
el: Η πώληση έχει λήξει
lb: Verkaf ass ofgeschloss

source: OpenID Sign In
el: Σύνδεση με OpenID
lb: OpenID Ageloggt

source: Image
el: Εικόνα
lb: Bild

source: Other auctions
el: Άλλες δημοπρασίες
lb: Anner Auktiounen

source: Sponsered
el: Χορηγημένο
lb: Gesponsert

source: New
el: Καινούργιο
lb: Nei

source: shipping
el: αποστολή
lb: Versand

source: Condition:
el: Κατάσταση:
lb: Zoustand:

source: Remaining time -
el: Υπολειπόμενος χρόνος -
lb: Restzäit -

source: Add to watchlist
el: Προσθήκη στη λίστα παρακολούθησης
lb: Zur Watchlist dobäisetzen

source: Shipping:
el: Αποστολή:
lb: Versand:

source: Free SpeedPAK Standard. See details
el: Δωρεάν αποστολή SpeedPAK Standard. Δείτε λεπτομέρειες
lb: Gratis SpeedPAK Standard. Details kucken

source: International shipment of items may be subject to customs processing and additional charges.
el: Η διεθνής αποστολή αντικειμένων ενδέχεται να υπόκειται σε δασμολογική επεξεργασία και επιπλέον χρεώσεις.
lb: International Versand vun Artikelen kann Zollbearbeitung a zousätzlech Käschte ënnerluecht ginn.

source: Located in: {City, Country}
el: Βρίσκεται στο: {Πόλη, Χώρα}
lb: Geluecht zu: {Stad, Land}

source: Delivery:
el: Παράδοση:
lb: Leverung:

source: Estimated between Thu, May 16 and Mon, Jun 3
el: Εκτιμώμενο ανάμεσα στις Πέμπτη, 16 Μαΐου και Δευτέρα, 3 Ιουνίου
lb: Geschätz tëscht Don, 16. Mee an Mon, 3. Jun

source: to 568745
el: σε 568745
lb: zu 568745

source: Please note the delivery estimate is greater than 15 business days.
el: Σημειώστε ότι η εκτίμηση παράδοσης είναι μεγαλύτερη από 15 εργάσιμες ημέρες.
lb: W.e.g. bemarkt datt d'Leverungsgeschätz méi wéi 15 Geschäftsdag ass.

source: Please allow additional time if international delivery is subject to customs processing.
el: Παρακαλούμε επιτρέψτε επιπλέον χρόνο εάν η διεθνής παράδοση υπόκειται σε δασμολογική επεξεργασία.
lb: W.e.g. gebt zousätzlech Zäit wann de internationale Versand Zollbearbeitung ënnerléit.

source: Returns:
el: Επιστροφές:
lb: Zréckgirof:

source: Seller does not accept returns. See details
el: Ο πωλητής δεν αποδέχεται επιστροφές. Δείτε λεπτομέρειες
lb: Verkäufer akzeptéiert keng Zréckgirof. Detailen kucken

source: Payments:
el: Πληρωμές:
lb: Zuelungen:

source: cards
el: κάρτες
lb: Käerten

source: About this item
el: Σχετικά με αυτό το αντικείμενο
lb: Iwwer dësen Artikel

source: Seller assumes all responsibility for this listing.
el: Ο πωλητής φέρει όλη την ευθύνη για αυτήν την καταχώρηση.
lb: De Verkäufer hëlt all Verantwortung fir dës Lëschtung.

source: Last updated on
el: Τελευταία ενημέρωση στις
lb: Lëtzt aktualiséiert den

source: View all revisions
el: Προβολή όλων των αναθεωρήσεων
lb: All Ännerungen kucken

source: Item specifics
el: Συγκεκριμένα αντικειμένου
lb: Artikel spezifesch

source: Hi
el: Γεια
lb: Hallo

source: Sign in to eBay Auctions or
el: Συνδεθείτε στις Δημοπρασίες eBay ή
lb: Ageloggt bei eBay Auktiounen oder

source: create an account
el: δημιουργήστε ένα λογαριασμό
lb: en Account creéieren

source: Login
el: Σύνδεση
lb: Ageloggt

source: Continue with Google
el: Συνέχεια με Google
lb: Weider mam Google

source: Register on eBay Auctions or
el: Εγγραφείτε στις Δημοπρασίες eBay ή
lb: Registréiert Iech op eBay Auktiounen oder

source: log in to your account
el: συνδεθείτε στον λογαριασμό σας
lb: mellt Iech op ärem Kont un

source: Registration
el: Εγγραφή
lb: Registréierung

source: Ship
el: Αποστολή

source: Done
el: Ολοκληρώθηκε
lb: Fäerdeg

source: first
el: πρώτο
lb: éischt

source: last
el: τελευταίο
lb: läscht

source: street
el: δρόμος
lb: Strooss

source: street 2
el: δρόμος 2
lb: Strooss 2

source: city
el: πόλη
lb: Stad

source: state
el: πολιτεία
lb: Staat

source: zip
el: ταχυδρομικός κώδικας

source: country
el: χώρα
lb: Land

source: email
el: ηλ. ταχυδρομείο

source: phone
el: τηλέφωνο
lb: Telefon

source: change
el: αλλαγή
lb: änneren

source: Pay with
el: Πληρώστε με
lb: Bezuelen mam

source: Add new card
el: Προσθήκη νέας κάρτας
lb: Nei Kaart derbäisetzen

source: Not working due to technical reasons
el: Δεν λειτουργεί λόγω τεχνικών αιτιών
lb: Net schaffen wéinst technescher Grënn

source: Item (1)
el: Αντικείμενο (1)
lb: Artikel (1)

source: Shipping
el: Αποστολή
lb: Versand

source: VAT
el: ΦΠΑ
lb: MwSt

source: Duties
el: Τέλη
lb: Zëllen

source: Order total
el: Συνολικό ποσό παραγγελίας
lb: Bestellung total

source: Confirm and pay
el: Επιβεβαιώστε και πληρώστε
lb: Bestätegen an zuelen

source: Enter shipping address
el: Εισαγάγετε διεύθυνση αποστολής
lb: Gitt d'Versandadress an

source: Social Network Login Failure
el: Αποτυχία σύνδεσης μέσω κοινωνικού δικτύου
lb: Sosialt Netzwierk Login Fehler

source: An error occurred while attempting to login via your social network account.
el: Παρουσιάστηκε σφάλμα κατά την προσπάθεια σύνδεσης μέσω του λογαριασμού σας στο κοινωνικό δίκτυο.
lb: E Feeler ass opgetrueden während Dir versicht hutt Iech mat ärer sozialer Netzwierkskont ageloggt.

source: Account Connections
el: Συνδέσεις λογαριασμού
lb: Kont Verbindungen

source: You can sign in to your account using any of the following third party accounts:
el: Μπορείτε να συνδεθείτε στον λογαριασμό σας χρησιμοποιώντας οποιονδήποτε από τους ακόλουθους λογαριασμούς τρίτων:
lb: Dir kënnt Iech op Ärem Kont ageloggt mat enger vun den folgenden dritte Party Konten:

source: You currently have no social network accounts connected to this account.
el: Αυτή τη στιγμή δεν έχετε συνδέσει κοινωνικού δικτύου λογαριασμούς σε αυτόν τον λογαριασμό.
lb: Ir hutt aktuell kee sozialt Netzwierk Kont mat dësem Kont verbonnen.

source: Add a 3rd Party Account
el: Προσθήκη λογαριασμού τρίτου μέρους
lb: Eng 3. Party Kont derbäisetzen

source: Connect %(provider)s
el: Σύνδεση %(provider)s
lb: Verbinden %(provider)s

source: You are about to connect a new third party account from %(provider)s.
el: Ετοιμάζεστε να συνδέσετε ένα νέο λογαριασμό τρίτου μέρους από το %(provider)s.
lb: Dir sidd derbäi e neit 3. Party Kont vu %(provider)s ze verbinden.

source: Sign In Via %(provider)s
el: Σύνδεση μέσω %(provider)s
lb: Mellt Iech via %(provider)s un

source: You are about to sign in using a third party account from %(provider)s.
el: Ετοιμάζεστε να συνδεθείτε χρησιμοποιώντας ένα λογαριασμό τρίτου μέρους από το %(provider)s.
lb: Dir sidd derbäi Iech mat engem 3. Party Kont vu %(provider)s unzemellen.

source: Continue
el: Συνέχεια
lb: Weider

source: Login Cancelled
el: Ακύρωση σύνδεσης
lb: Ageloggt ofbriechen

source: You decided to cancel logging in to our site using one of your existing accounts. If this was a mistake, please proceed to <a href="%(login_url)s">sign in</a>.
el: Αποφασίσατε να ακυρώσετε την είσοδο στον ιστότοπό μας χρησιμοποιώντας έναν από τους υπάρχοντες λογαριασμούς σας. Εάν πρόκειται για λάθος, παρακαλούμε προχωρήστε στην <a href="%(login_url)s">σύνδεση</a>.
lb: Dir hutt decidéiert d'Ageloggt ofzebriechen op eisem Site mat enger vun Äre bestoende Konten. Falls dat en Irrtum war, gitt w.e.g. op <a href="%(login_url)s">ageloggt</a>.

source: The social account has been connected.
el: Ο κοινωνικός λογαριασμός συνδέθηκε επιτυχώς.
lb: D'Sozial Kont gouf verbonnen.
